exploring_data2::

selecting particular data:

columns and row

In [ ]:
# libraries
import pandas as pd

In [ ]:
df = pd.DataFrame({'name':pd.Series(['riya','julie','marie','sandy','garim','darsh','ranisha','john']),'age':pd.Series([15,16,15,15,16,15,15,15]),'eng_marks':pd.Series([78,45,90,88,65,94,52,63]),'sci_marks':pd.Series([87,54,100,78,55,44,92,73])})
df

      name  age  eng_marks  sci_marks
0     riya   15         78         87
1    julie   16         45         54
2    marie   15         90        100
3    sandy   15         88         78
4    garim   16         65         55
5    darsh   15         94         44
6  ranisha   15         52         92
7     john   15         63         73

In [ ]:
# selecting one columns:
# returning a series
name_series = df['name']
name_series
type(name_series)

pandas.core.series.Series

In [ ]:
# selecting multiple columns
# returning a df
# why double brackets?
marks = df[['eng_marks','sci_marks']]
marks

   eng_marks  sci_marks
0         78         87
1         45         54
2         90        100
3         88         78
4         65         55
5         94         44
6         52         92
7         63         73

In [ ]:
# selecting rows:
# loc[](labels) & iloc[](index) & ix[](labels but if labels are absent uses index)

In [ ]:
df.index = ([12,8,5,9,5,32,4,1])

In [ ]:
# loc[]
# with [particular label/labels]
# with labels as index range
# print(df2.loc['garim':'darsh'])

In [ ]:
# iloc[]

In [ ]:
df = pd.DataFrame({'name':pd.Series(['riya','julie','marie','sandy','garim','darsh','ranisha','john']),'age':pd.Series([15,16,15,15,16,15,15,15]),'eng_marks':pd.Series([78,45,90,88,65,94,52,63]),'sci_marks':pd.Series([87,54,100,78,55,44,92,73])})
df

      name  age  eng_marks  sci_marks
0     riya   15         78         87
1    julie   16         45         54
2    marie   15         90        100
3    sandy   15         88         78
4    garim   16         65         55
5    darsh   15         94         44
6  ranisha   15         52         92
7     john   15         63         73

In [ ]:
df.loc[0:3]

    name  age  eng_marks  sci_marks
0   riya   15         78         87
1  julie   16         45         54
2  marie   15         90        100
3  sandy   15         88         78

In [ ]:
df.iloc[0:4]

    name  age  eng_marks  sci_marks
0   riya   15         78         87
1  julie   16         45         54
2  marie   15         90        100
3  sandy   15         88         78

In [ ]:
df.index = ([12,11,13,4,5,6,7,9])

In [ ]:
df.head()

     name  age  eng_marks  sci_marks
12   riya   15         78         87
11  julie   16         45         54
13  marie   15         90        100
4   sandy   15         88         78
5   garim   16         65         55

In [ ]:
df.loc[12:13]

     name  age  eng_marks  sci_marks
12   riya   15         78         87
11  julie   16         45         54
13  marie   15         90        100

In [ ]:
df.iloc[0:3]

     name  age  eng_marks  sci_marks
12   riya   15         78         87
11  julie   16         45         54
13  marie   15         90        100

In [ ]:
df.set_index('name',inplace=True)

In [ ]:
df

         age  eng_marks  sci_marks
name
riya      15         78         87
julie     16         45         54
marie     15         90        100
sandy     15         88         78
garim     16         65         55
darsh     15         94         44
ranisha   15         52         92
john      15         63         73

In [ ]:
df.loc['riya':'marie']

       age  eng_marks  sci_marks
name
riya    15         78         87
julie   16         45         54
marie   15         90        100

In [ ]:
df.iloc[0:3]

       age  eng_marks  sci_marks
name
riya    15         78         87
julie   16         45         54
marie   15         90        100

In [ ]:
type(df['eng_marks']>60)

pandas.core.series.Series

In [ ]:
df.loc[df['eng_marks']>60]

       age  eng_marks  sci_marks
name
riya    15         78         87
marie   15         90        100
sandy   15         88         78
garim   16         65         55
darsh   15         94         44
john    15         63         73

In [ ]:
df.iloc[list(df['eng_marks']>60)]

       age  eng_marks  sci_marks
name
riya    15         78         87
marie   15         90        100
sandy   15         88         78
garim   16         65         55
darsh   15         94         44
john    15         63         73

In [ ]:
df.loc['abc']

KeyError: ignored

In [ ]:
df.iloc[15]

IndexError: ignored

In [ ]:
df.iloc[1:6,1:3]

       eng_marks  sci_marks
name
julie         45         54
marie         90        100
sandy         88         78
garim         65         55
darsh         94         44